# -*- coding:utf-8 -*-
'''
Created on Aug 16, 2020

@author: patch
'''
from collections import OrderedDict

CITIES = OrderedDict()
LAN = OrderedDict([
    ('01',u'Scratch'),
    ('02',u'MicroBlocks'),
    ('03',u'Scratch-Microbit'),
    ('04',u'Snap'),
    ('05',u'Makecode'),
    ('20',u'Arduino'),
    ('07',u'JavaScript'),
    ('12',u'python')
    ])

SERIES = OrderedDict([
    ('01',u'互动动画'),
    ('05',u'魔法桌面'),
    ('10',u'硬件基础'),
    ('20',u'硬件扩展'),
    ('60',u'游戏')
    ])
#游戏、故事、笑话、音乐、美术、音乐动画、仿真、教程
THEME = OrderedDict([
    ('Design', u'造型设计'),
    ('Game', u'游戏'),
    ('Tale', u'故事'),
    ('Joke', u'笑话'),
    ('Music', u'音乐'),
    ('Art', u'艺术'),
    ('MV', u'音乐动画'),
    ('Emulate', u'仿真'),
    ('Course', u'教程'),
    ('App', u'应用')
    ])

SKILL = OrderedDict([
    ('01',u'移动'),
    ('02',u'动画'),
    ('03',u'造型'),
    ('04',u'克隆'),
    ('05',u'变量'),
    ('06',u'循环'),
    ('07',u'条件'),
    ('08',u'运算'),
    ('09',u'三角函数'),
    ('10',u'自定义'),
    ('11',u'视频侦测'),
    ('12',u'画笔'),
    ('13',u'声音和音乐'),
    ('14',u'语言'),
    ('15',u'坐标'),
    ('16',u'列表'),
    ('17',u'消息'),
    ('18',u'时间控制'),
    ('19',u'侦测'),
    ('20',u'流程控制'),
    ('21',u'外观效果'),
    ('22',u'可拖动'),
    ('23',u'导入导出'),
    ('24',u'问答'),
    ('25',u'颜色侦测'),
    ('26',u'说与想'),
    ('27',u'组合运算'),
    ('28',u'朗读'),
    ('29',u'语音识别'),
    ('30',u'翻译'),
    ('31',u'图片识别')

    ])

EXTENTION = OrderedDict([
    ('01',u'AI-文字朗读'),
    ('02',u'AI-语音识别'),
    ('03',u'AI-翻译'),
    ('04',u'AI-图片识别'),
    ('10',u'AI-视频侦测'),
    ('11',u'EV3'),
    ('12',u'WeDo2.0'),
    ('13',u'micro:bit'),
    ('14',u'Arduino')
    ])

SENSOR = OrderedDict([
    ('01',u'运动'),
    ('02',u'颜色'),
    ('03',u'温度'),
    ('04',u'亮度'),
    ('05',u'磁力'),
    ('06',u'人体'),
    ('07',u'microbit logo'),
    ('08',u'数字输入'),
    ('09',u'模拟输入')
    ])

OUTPUT = OrderedDict([
    ('01',u'数字输出'),
    ('02',u'模拟输出'),
    ('03',u'步进马达'),
    ('04',u'马达'),
    ('05',u'扬声器')
    ])

ABILITY = OrderedDict([
    ('A',u'语言表达'),
    ('B',u'视觉表达'),
    ('C',u'声音表现'),
    ('D',u'逻辑'),
    ('E',u'计算'),
    ('F',u'空间认知'),
    ('G',u'常识'),
    ('H',u'想象力'),
    ('I',u'专注力')
    ])

GRADE = OrderedDict([

    ('1',u'一年级'),
    ('2',u'二年级'),
    ('3',u'三年级'),
    ('4',u'四年级'),
    ('5',u'五年级'),
    ('6',u'六年级'),
    ('7',u'初一'),
    ('8',u'初二'),
    ('9',u'初三'),
    ('-1',u'幼儿园中班'),
    ('0',u'幼儿园大班')
    ])
